/* IDE ATA-2 Device Driver for MMURTL.
   This driver depends on data requested from ATA-2 devices
   for drive geometry.  This will not work for older IDE
   devices. This REPLACES the old HARDIDE.C driver.
   This requires the newer Fsys.c (Version 1.1).

  MMURTL Operating System Source Code
  Copyright 1991,1992,1993,1994,1995,1996 Richard A. Burgess
  ALL RIGHTS RESERVED   Version 1.1
*/

#define U32 unsigned long
#define S32 long
#define U16 unsigned int
#define S16 int
#define U8 unsigned char
#define S8 char

/* MMURTL OS PROTOTYPES */

extern far AllocExch(U32  *pExchRet);
extern far U32  InitDevDr(U32  dDevNum,
				    	  S8  *pDCBs,
					  	  U32  nDevices,
					  	  U32  dfReplace);

extern far U32  UnMaskIRQ(U32  IRQNum);
extern far U32  MaskIRQ(U32  IRQNum);
extern far U32  SetIRQVector(U32  IRQNum, S8  *pIRQ);
extern far U32  EndOfIRQ(U32  IRQNum);
extern far U32  SendMsg(U32  Exch, U32  msg1, U32  msg2);
extern far U32  ISendMsg(U32  Exch, U32  msg1, U32  msg2);
extern far U32  WaitMsg(U32  Exch, U32  *pMsgRet);
extern far U32  CheckMsg(U32  Exch, U32  *pMsgRet);
extern far U32  Alarm(U32  Exch, U32  count);
extern far U32  KillAlarm(U32  Exch);
extern far U32  Sleep(U32  count);
extern far void MicroDelay(U32  us15count);
extern far void OutByte(U8 Byte, U16 wPort);
extern far void OutWord(U16 Word, U16 wPort);
extern far U8 InByte(U16 wPort);
extern far U16 InWord(U16 wPort);
extern far U8 ReadCMOS(U16 Address);

	 5 - high cyl        (1F5h)
	 6 - size/drive/head (1F6h)
	 7 - status register (1F7h)
*/

#define HD_REG_PORT 0x3f6

/* This is a byte wide write only control port
   that allows reset and defines some special
   characteristics of the hard drives.
	Bit		Desc
	0		Not used
	1		Not used
	2		Reset Bit - Set, wait 50us, then Reset
	3		Mucho Heads Flag. Set = More than 8 heads
	4		Not used
	5		Not used
	6		Disable retries
	7		Disable retries (same as six, either one set)
*/

/* Ports for secondary ide controller  */
#define HD_PORT_2	0x170
#define HD_REG_PORT_2	0x376

/* HDC Status Register Bit Masks (1F7h) */

#define BUSY        0x80  /* busy.. can't talk now! */
#define READY       0x40  /* Drive Ready  */
#define WRITE_FAULT 0x20  /* Bad news */
#define SEEKOK      0x10  /* Seek Complete */
#define DATA_REQ    0x08  /* Sector buffer needs servicing */
#define CORRECTED   0x04  /* ECC corrected data was read */
#define REV_INDEX   0x02  /* Set once each disk revolution */
#define ERROR       0x01  /* data address mark not found */

/* HDC Error Register Bit Masks (1F1h) */

#define BAD_SECTOR  0x80  /* bad block */
#define BAD_ECC     0x40  /* bad data ecc */
#define BAD_IDMARK  0x10  /* id not found */
#define BAD_CMD     0x04  /* aborted command */
#define BAD_SEEK    0x02  /* trk 0 not found on recalibrate, or bad seek */
#define BAD_ADDRESS 0x01  /* data address mark not found */


/* HDC internal command bytes (HDC_Cmd[7]) */

#define HDC_RECAL      0x10	  /* 0001 0000 */
#define HDC_READ       0x20   /* 0010 0000 */
#define HDC_READ_LONG  0x22   /* 0010 0010 */
#define HDC_WRITE      0x30   /* 0011 0000 */
#define HDC_WRITE_LONG 0x32   /* 0011 0010 */
#define HDC_VERIFY     0x40   /* 0100 0000 */
#define HDC_FORMAT     0x50   /* 0101 0000 */
#define HDC_SEEK       0x70   /* 0111 0000 */
#define HDC_DIAG       0x90   /* 1001 0000 */
#define HDC_SET_PARAMS 0x91   /* 1001 0001 */
#define HDC_ID         0xEC   /* 1001 0001 */

/* L O C A L   D A T A  */
/* Made all of these arrays to support
 * multiple controllers!  */

static U8 hd_Cmd[2][8];		/* For all 8 command bytes, controllers 0-1 */

static U8 fDataReq[4];		/* Flag to indicate if fDataRequest is active, drives 0-3 */
static U8 statbyte[2];		/* From HDC status register last time it was read, controllers 0-1 */

static U8 hd_control[4];	/* Current control byte value, controller 0-1 */

static U8  hd_drive[4];		/* Current Physical Drive, 0-3 */
static U8  hd_head[4];		/* Calculated from LBA - which head, drives 0-3 */
static U8  hd_nsectors[4];	/* Calculated from LBA - n sectors to read/write, drives 0-3 */
static U8  hd_sector[4];	/* Calculated from LBA - Starting sector, drives 0-3 */

/* Current type drive 0-3 set by caller. */
/* Current number of heads, cylinders, and sectors set by caller */
static U8	hd_type[4];
static U8	hd_heads[4];
static U8	hd_secpertrk[4];
static U16	hd_cyls[4];

#define sIDEid 512

static struct idestruct
 {			/* 16 BIT WORD offset */
  U16 config;		/* 0  General IDE configuration */
  U16 ncyls;		/* 1 */
  U16 rsvd1;		/* 2 */
  U16 nheads;		/* 3 */
  U16 rsvd2;  		/* 4 */
  U16 rsvd3;  		/* 5 */
  U16 nsectpertrk;	/* 6 */
  U16 rsvd4[3];		/* 7-9    Vendor specific */
  U16 serial[10];	/* 10-19  Device serial # */
  U16 rsvd5[2];     	/* 20-21  Vendor specific */
  U16 bytesavail;	/* 22     # of vendor specific bytes avail on read LONG */
  U8 firmrev[8];	/* 23-26  Firmware revision - ASCII 8 */
  U8 model[40];		/* 27-46  Device Model # */
  U16 rdmulti;		/* 47     Info on Read Multiple commands */
  U16 rsvd6;		/* 48 */
  U16 capabil;		/* 49     Capabilties */
  U16 rsvd7;		/* 50 */
  U16 pioxfermode;	/* 51 */
  U16 dmaxfermode;	/* 52 */
  U16 validflds;	/* 53 */
  U16 ncylsx;		/* 54-56 current/xlated cyls, heads, sect per tracks */
  U16 nheadsx;
  U16 nsectpertrkx;
  U32 capsectors;	/* 57-58 long */
  U16 rdmultisect;	/* 59    More info in read multiple sectors command */
  U32 totalsectlba;	/* 60-61 Total sectors in LBA mode only */
  U16 singldmaxfer;	/* 62 */
  U16 multidmaxfer;	/* 63 */
  U16 advancedpio;	/* 64 */
  U16 dmatimemin;	/* 65 */
  U16 dmatimerec;	/* 66 */
  U16 piotimemin;	/* 67 */
  U16 piotimerec;	/* 68 */
  U16 piorsvd;		/* 69 */
  U16 piorsvd1;		/* 70 */
  U16 rsvd8[127-71+1]; 	/* 71-127 */
  U16 rsvd9[159-128+1];	/* 128-159 */
  U16 rsvd9[255-160+1];	/* 160-255 */
  };

/* One struct per disk instead of a single shared one  */
static struct idestruct IDEid[4];

#define sStatus 64

static struct statstruct
 {
  U32 erc;
  U32 blocks_done;
  U32 BlocksMax;
  U8 fNewMedia;
  U8 type_now;		/* current fdisk_table for drive selected */
  U8 resvd0[2];		/* padding for DWord align  */
  U32 nCyl;		/* total physical cylinders */
  U32 nHead;		/* total heads on device    */
  U32 nSectors;		/* Sectors per track        */
  U32 nBPS;		/* Number of bytes per sect.  32 bytes out to here.*/

  U32 LastRecalErc0;
  U32 LastSeekErc0;
  U8  LastStatByte0;
  U8  LastErcByte0;
  U8  fIntOnReset;	/* Interrupt was received on HDC_RESET */
  U8  filler0;

  U32 LastRecalErc1;
  U32 LastSeekErc1;
  U8  LastStatByte1;
  U8  LastErcByte1;
